<?php

namespace App\Console\Commands;

use App\Helpers\BotHelper;
use App\Models\BotLog;
use Carbon\Carbon;
use Illuminate\Console\Command;
use Telegram;

class UsersRankingCommand extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'app:users-ranking-command';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    /**
     * Execute the console command.
     */
    public function handle()
    {
        $logs = BotLog::whereLanguage('fa')->select('chat_id', 'type')->distinct('chat_id')->get();

        $token = env("QURAN_HEFZ_BOT_TOKEN_BALE");
        $botBale = new Telegram($token, 'bale');

        $token = env("QURAN_HEFZ_BOT_TOKEN_TELEGRAM");
        $botTelegram = new Telegram($token);

        foreach ($logs as $log) {
            $this->userStatisticPerDayReport($log, $botBale, $botTelegram);
        }

        //

    }

    /**
     * @param mixed $log
     * @param Telegram $botBale
     * @param Telegram $botTelegram
     * @return void
     */
    public function userStatisticPerDayReport(mixed $log, Telegram $botBale, Telegram $botTelegram): void
    {
//        if ($log['chat_id'] == "485750575") {
        $count_today = BotLog::whereChatId($log['chat_id'])->where('created_at', '>=', Carbon::now()->subDay())
            ->count();
        $count_yesterday = BotLog::whereChatId($log['chat_id'])->where('created_at', '>=', Carbon::now()->subDay())
            ->count();
        $result_ayat = $count_today - $count_yesterday;
        $result_ayat_if_negetive = $count_yesterday - $count_today;

        $postfix_hadith = "";
        if ($result_ayat == 0 && $count_today == 0) {
            $postfix_hadith = "
به شما توصیه میکنیم بخاطر تعداد صفر آیه مطالعه در دو روز گذشته احادیث زیر را یک مطالعه بفرمایید.

https://www.imamalicenter.se/fa/20hadith_om_Koran
";
        }

        $postfix = $result_ayat > 0 ? $result_ayat . " پیشرفت داشته اید " : $result_ayat_if_negetive . " آیه کمتر مطالعه کردید ";

        $message = "آمار کل استفاده های شما از این روبات در تلگرام و بله امروز
:" . $count_today . "آیه
که در مقایسه با روز قبل " . $count_yesterday . "
" . $postfix . $postfix_hadith . $this->random_hadith();

        if ($log['type'] == 'bale')
            BotHelper::sendMessageByChatId($botBale, $log['chat_id'], $message);
        else
            BotHelper::sendMessageByChatId($botTelegram, $log['chat_id'], $message);
//        }
    }


    public function random_hadith()
    {

        $hadiths = array();

        $hadiths[] = "
        پیامبر اسلام (ص):

1- اِنَّ البَيتَ اِذا كَثُرَ فيهِ تِلاوَةُ القُرآنِ كَثُرَ خَيرُهُ وَ اتَّسَعَ اَهلُهُ وَ اَضاءَ لاَهلِ السَّماءِ كَما تُضى ءُ نُجومُ السَّماءِ لاَهلِ الدُّنيا؛

خانه اى كه در آن قرآن فراوان خوانده شود، خير آن بسيار گردد و به اهل آن وسعت داده شود و براى آسمانيان بدرخشد چنان كه ستارگان آسمان براى زمينيان مى درخشند.

        كافى(ط-الاسلامیه) ج2، ص610
 ";


        $hadiths[] = "

پیامبر اسلام (ص):

2- خیارکم من تعلم قرآن و عـلمه
بهترین شما کسیست که قرآن را بیاموزد و آموزش دهد.

        نهج الفصاحه ص473 ،ح1524 - وسایل الشیعه ج6 ، ص167 ، ح7641

 ";


        $hadiths[] = "

پیامبر اسلام (ص):

3- يا بُنَىَّ لاتَغفُل عَن قِراءَةِ القُرآنِ- إذا أصبحت، و إذا أمسيت- فَاِنَّ القُرآنَ يُحيِى القَلبَ المیت وَ يَنهى عَنِ الفَحشاءِ و َالمُنكَرِ ؛
فرزندم از خواندن قرآن غافل مباش، زيرا كه قرآن دل  مرده را زنده مى كند و از فحشاء و زشتى  باز مى دارد.

        البرهان فی تفسیر القرآن ج1 ،ص19

 ";


        $hadiths[] = "
پیامبر اسلام (ص):

4- اِن اَرَدتُم عَيشَ السُّعَداءِ و َمَوتَ الشُّهَداءِ و َالنَّجاةَ يَومَ الحَسرَةِ و َالظِّلَّ يَومَ الحَرورِ و َالهُدى يَومَ الضَّلالَةِ فَادرُسُوا القُرآنَ فَاِنَّهُ كَلامُ الرَّحمانِ و حِرزٌ مِنَ الشَيطانِ و رُجحانٌ فِى الميزانِ ؛
اگر زندگى سعادتمندان، مرگ شهيدان، نجات روز حسرت (قيامت)، سايه روزِ سوزان و هدايت در روز گمراهى را مى خواهيد، قرآن را ياد بگيريد كه آن سخن خداى مهربان است و سپرى است در مقابل شيطان و سنگينى در ترازوى اعمال.

        الحیاه(ترجمه ی احمد آرام) ج2 ،ص234

 ";


        $hadiths[] = "
پیامبر اسلام (ص):

5- اَصدَقُ القَولِ و َاَبلَغُ المَوعِظَةِ و َاَحسَنُ القَصَصِ كِتابُ اللّه ؛
راست ترين سخن، رساترين پند و زيباترين حكايت، كتاب خدا (قرآن) است.

        من لایحضر الفقیه ج4 ، ص402

 ";


        $hadiths[] = "
پیامبر اسلام (ص):

6- مَن قَرَأَ القُرآنَ ابتِغاءَ وَجهِ اللّه و َتَفَقُّها فِى الدّينِ كانَ لَهُ مِنَ الثَّوابِ مِثلَ جَميعِ ما اُعطِىَ المَلائِكَةُ و َالأنبياءُ وَ المُرسَلونَ؛
هر كس براى كسب رضايت خدا و آگاهى در دين قرآن بياموزد، ثوابى مانند همه آنچه كه به فرشتگان و پيامبران و رسولان داده شده، براى اوست.

        وسائل الشيعه، ج6، ص184، ح7683


 ";


        $hadiths[] = "
امام علی (ع):
7- عَلَيكُم بِكِتابِ اللّه ... مَن عَمِلَ بِهِ سَبَقَ؛
بر شما باد رجوع به كتاب خدا (قرآن) ... كسى كه به آن عمل كند از همه پيشى مى گيرد.

        نهج البلاغه(صبحی صالح) ص219 ، خطبه 156


 ";


        $hadiths[] = "
امام علی (ع):
8- اَلا اِنَّ فيهِ عِلمَ ما يَأتى و َالحَديثَ عَنِ المَاضى و َدَواءَ دائِكُم و نَظمِ ما بَينَكُم؛
آگاه باشيد كه دانش آينده، اخبار گذشته و درمان دردهايتان و نظم ميان شما در قرآن است.

        نهج البلاغه(صبحی صالح) ص223 ، خطبه 158


 ";


        $hadiths[] = "
امام علی (ع):
9- اِنَّ القرآنَ ظاهِرُهُ اَنيقٌ و َباطِنُهُ عَميقٌ لا تَفنى عَجائِبُهُ و َلا تَنقَضى غَرائِبُهُ و َلا تُكشَفُ الظُّلُماتُ اِلاّ بِهِ؛
براستى كه قرآن ظاهرش زيباست و باطنش عميق، عجايبش پايان ندارد، اسرار نهفته آن پايان نمى پذيرد و تاريكى هاى جهل جز بوسيله آن رفع نخواهد شد.

        نهج البلاغه(صبحی صالح) ص223 ، خطبه 18

 ";


        $hadiths[] = "
امام صادق (ع):
10- مَن لَم يَعرِفِ الحَقَّ مِنَ القُرآنِ لَم يَتَنَكَّبِ الفِتَنَ؛
هر كس حقيقت را از طريق قرآن نشناسد، از فتنه ها بركنار نمى ماند.

        محاسن، ج1، ص216
 ";


        $hadiths[] = "
امام علی (ع):
11- وَ حَقُّ الوَلَدِ عَلَى الوالِدِ أن يُحَسِّنَ اِسمَهُ وَ يُحَسِّنَ اَدَبَه ُ، و يُعَلِّمَهُ القُرآنَ؛

حقّ فرزند بر پدر ، آن است كه نام خوب بر او بگذارد و او را خوب تربيت كند و قرآن به او بياموزد.

        نهج البلاغة(صبحی صالح) ص546 ، حكمت 399
 ";


        $hadiths[] = "
پیامبر اسلام (ص):

12- مَن قَـبَّلَ وَلَدَهُ كَـتَبَ اللّه عَزَّوَجَلَّ لَهُ حَسَنَةً و َمَن فَرَّحَهُ فَرَّحَهُ اللّه يَومَ القيامَةِ، و َمَن عَلَّمُهُ القُرآنَ دُعىَ بِالابـَوَينِ فَيُكسَيانِ حُلَّتَينِ يُضى ءُ مِن نورِهِما وُجوهُ اَهلِ الجَنَّةِ ؛

هر كس فرزندش را ببوسد ، خداوند عزّوجلّ براى او ثواب مى نويسد و هر كسى كه او را شاد كند ، خداوند روز قيامت او را شاد خواهد كرد و هر كس قرآن به او بياموزد ، پدر و مادرش دعوت مى شوند و دو لباس بر آنان پوشيده مى شود كه از نور آنها ، چهره هاى بهشتيان نورانى مى گردد.

        كافى(ط-الاسلامیه) ج 6، ص 49
 ";


        $hadiths[] = "
امام صادق (ع):
13- مَن قَرَاَ القُرآنَ وَ هُوَ شابٌّ مُؤمِنٌ اِختَلَطَ القُرآنُ بِلَحمِهِ وَ دَمِهِ وَ جَعَلَهُ اللّه عَزَّوَجَلَّ مَعَ السَّفَرَةِ الكِرامِ البَرَرَةِ ، وَ كانَ القُرآنُ حَجيزا عَنهُ يَومَ القيامَةِ ؛
هر جوان مؤمنى كه در جوانى قرآن تلاوت كند، قرآن با گوشت و خونش مى آميزد و خداوند عزّوجلّ او را با فرشتگان بزرگوار و نيك قرار مى دهد و قرآن نگهبان او در روز قيامت، خواهد بود.

        كافى(ط-الاسلامیه) ج 2، ص 603

 ";


        $hadiths[] = "
امام علی (ع):
14- ثُمَّ أَنزَلَ عَلَيهِ الكِتابَ... وَعِزّا لاتُهزَمُ أَنصارُهُ... ؛
قرآنى كه بر پيامبر نازل شد... عزتى است كه هوادارانش شكست نمى خورند... .

نهج البلاغه(صبحی صالح) ص315 ، خطبه 198

 ";


        $hadiths[] = "
پیامبر اسلام (ص):
15- أَدِّبوا أولادَكُم عَلى ثَلاثِ خِصال ٍ: حُبِّ نَبيِّكُم و َحُبِّ أَهلِ بَيتِهِ و َقِراءَةِ القُرآنِ؛
فرزندان خود را به كسب سه خصلت تربيت كنيد: دوستى پيامبرتان و دوستى خاندانش و قرائت قرآن.

        قاموس قرآن ، المقدمه ، ص2

 ";


        $hadiths[] = "
حضرت زهرا (س):
16- قاریءُ الحدید، و اذا وقعت، و الرحمن، یدعی فی الملکوت السموات ، ساکن الفردوس؛
تلاوت کننده سوره حدید و واقعه و الرحمن در آسمانها  اهل بهشت خوانده می شوند.

        عوالم العلوم و المعارف (مستدرک حضرت زهرا تا امام جواد علیه السلام) ج11 ، قسم2،حضرت فاطمه سلام الله علیها ،ص915

 ";


        $hadiths[] = "
امام رضا (ع):

17- مَن قَرَاَ فى شَهرِ رَمضانَ آیَة مِن کِتابِ اللهِ کانَ کَمَن خَتَمَ القُرآنَ فِى غَیرِه مِن الشُهُورِ؛

هر کس ماه رمضان یک آیه از کتاب خدا را قرائت کند مثل اینست که درماههاى دیگر تمام قرآن را بخواند.

        بحار الانوار(ط-بیروت) ج93، ص341

 ";


        $hadiths[] = "
پیامبر اسلام (ص):
18- ما جلس قوم فی مجلس من مساجد اللّه‏ِ يَتْلونَ كِتابَ اللّه‏ِ وَ يَتَدارَسونَهُ بَيْنَهُمْ اِلاّ نَزَلَتْ عَلَيْهِمُ السَّكينَةُ وَ غَشِيَتْهُمُ الرَّحْمَةُ وَ حَفَّتْهُمُ الْمَلائِكَةُ وَ ذَكَرَهُمُ اللّه‏ُ فيمَنْ عِنْدَهُ؛
هيچ جلسه قرآنى براى تلاوت و درس در مجلسی از مساجد خدا برقرار نشد، مگر اين كه آرامش بر آنان نازل شد و رحمت دربرشان گرفت و فرشتگان در اطراف آنان حلقه زدند و خداوند در ميان كسانى كه در نزدش هستند، از آنان ياد كرد.

        مستدرک الوسایل و مستنبط المسایل ح3788، ج3 ، ص 363

 ";


        $hadiths[] = "
پیامبر اسلام (ص):
19- اِنَّ اَحْسَنَ الْحَديثِ كِتابُ اللّه‏ِ وَ خَيْرَ الْهُدى هُدى مُحَمَّدٍ صلى‏ الله‏ عليه ‏و ‏آله وَ شَرَّ الاُمورِ مُحْدَثاتُها؛
بهترين سخن، كتاب خدا و بهترين روش، روش پيامبر صلى ‏لله‏ عليه ‏و ‏آله و بدترين امور بدعت‏هاست (پديده‏هاى مخالف دين).

امالی (طوسی) ص 337 - بحارالأنوار(ط-بیروت)، ج 74، ص 122

 ";


        $hadiths[] = "
امام علی (ع):
20- اِنَّ اللّه‏َ تعالى اَنْزَلَ كِتابا هاديا بَيَّنَ فيهِ الْخَيْرَ وَ الشَّرَّ، فَخُذوا نَهْجَ الْخَيْرِ تَهْتَدوا وَ اَصْدِفوا عَنْ سَمْتِ الشَّرِّ تَقْصِدوا؛
خداى تعالى كتابى راهنما فرستاد و در آن خوب و بد را روشن ساخت. پس راه خوبى را پيش گيريد تا هدايت شويد و از راه بدى دورى جوييد تا به مقصد برسيد.

        نهج البلاغه(صبحی صالح) ص 242 ، خطبه 167

 ";

        $randomNumber = rand(0, 19);

        return $hadiths[$randomNumber];

    }
}
